ErpTest/src/InformationRegisters/уатНоменклатураГСМ/уатНоменклатураГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНоменклатураГСМ</name>
  <comment>Доп. сведения для ГСМ</comment>
  <resources>
    <name>ВестиУчетОстатковТЖ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаГСМ</name>
    <type>
      <types>EnumRef.уатГруппыГСМ</types>
    </type>
  </resources>
  <resources>
    <name>ГСМТалона</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ЛитровыйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоминалТалона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Плотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатГруппыГСМ/уатГруппыГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппыГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Топливо</name>
  </enumValues>
  <enumValues>
    <name>Масло</name>
  </enumValues>
  <enumValues>
    <name>Талон</name>
  </enumValues>
  <enumValues>
    <name>ПрисадкиИТехническиеЖидкости</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/CommonForms/уатСписокГСМ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ГруппаГСМ") И Параметры.Свойство("ТС") И Параметры.Свойство("Организация") Тогда
		Если Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Талон") Тогда
			Заголовок = "Талоны ГСМ для авто. " + уатОбщегоНазначения.уатПредставлениеТС(Параметры.ТС, Параметры.Организация);
		ИначеЕсли Параметры.ГруппаГСМ = ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Масло") Тогда
			Заголовок = "Масла и смазочные материалы";
		Иначе //топливо
			Если Параметры.БезАналогов Тогда
				Заголовок = "Основное топливо для ТС " ;
			Иначе	
				Заголовок = "Топливо для ТС " ;
			КонецЕсли;
			Заголовок = Заголовок + уатОбщегоНазначения.уатПредставлениеТС(Параметры.ТС, Параметры.Организация);
		КонецЕсли;
		
		мсвГСМ = уатЗащищенныеФункцииСервер.СписокГСМдляТССервер(Параметры.Организация, Параметры.ТС, Параметры.ГруппаГСМ, 
			Параметры.БезАналогов);
		ТаблицаГСМ.Очистить();
		
		флЕстьТалоны = Ложь;
		
		Для Каждого ТекЭл Из мсвГСМ Цикл
			НоваяСтрока = ТаблицаГСМ.Добавить();
			НоваяСтрока.ГСМ = ТекЭл.ГСМ;
			НоваяСтрока.ГСМТалона = ТекЭл.ГСМТалона;
			НоваяСтрока.Литровый = ТекЭл.Литровый;
			НоваяСтрока.Номинал = ТекЭл.Номинал;
			
			Если ЗначениеЗаполнено(ТекЭл.ГСМТалона) Тогда
				флЕстьТалоны = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если флЕстьТалоны Тогда
			Элементы.ТаблицаГСМГСМТалона.Видимость = Истина;
			Элементы.ТаблицаГСМЛитровый.Видимость = Истина;
			Элементы.ТаблицаГСМНоминал.Видимость = Истина;
		КонецЕсли;
		
		Если Параметры.Свойство("УчитыватьТЖ") И Параметры.УчитыватьТЖ Тогда
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	уатНоменклатураГСМ.Номенклатура
			|ИЗ
			|	РегистрСведений.уатНоменклатураГСМ КАК уатНоменклатураГСМ
			|ГДЕ
			|	уатНоменклатураГСМ.ВестиУчетОстатковТЖ");
			тблТЖ = Запрос.Выполнить().Выгрузить();
			Для Каждого ТекСтрока Из тблТЖ Цикл
				НоваяСтрока = ТаблицаГСМ.Добавить();
				НоваяСтрока.ГСМ = ТекСтрока.Номенклатура;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаГСМВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ТекСтрока = Элементы.ТаблицаГСМ.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ТекСтрока.ГСМ);
	КонецЕсли;
КонецПроцедуры
